Ove88/kw41z-rf-driver/source/fsl_xcvr.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "EmbeddedTypes.h"
#include "fsl_device_registers.h"
#include "fsl_common.h"
#include "fsl_xcvr.h"
#include "fsl_xcvr_trim.h"
#include <math.h>
#include "ifr_radio.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define channelMapTableSize (128U)   
#define gPllDenom_c 0x02000000U      /* Denominator is a constant value */
#define ABS(x) ((x) > 0 ? (x) : -(x))

#ifndef TRUE
#define TRUE                    (true)
#endif

#ifndef FALSE
#define FALSE                   (false)
#endif

#ifndef EXTERNAL_CLOCK_GEN
#define EXTERNAL_CLOCK_GEN 0
#endif

#define ANT_A   1
#define ANT_B   0
     
#ifndef XCVR_COEX_RF_ACTIVE_PIN
#define XCVR_COEX_RF_ACTIVE_PIN ANT_B
#endif

typedef struct xcvr_pllChannel_tag
{
    unsigned int integer;
    unsigned int numerator;
} xcvr_pllChannel_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
void XcvrPanic(XCVR_PANIC_ID_T panic_id, uint32_t panic_address);

/*******************************************************************************
 * Variables
 ******************************************************************************/
static panic_fptr s_PanicFunctionPtr = NULL;
const xcvr_pllChannel_t mapTable [channelMapTableSize] =
{
    {0x00000025, 0x07C00000},    /* 0 */
    {0x00000025, 0x07C80000},    /* 1 */
    {0x00000025, 0x07D00000},    /* 2 */
    {0x00000025, 0x07D80000},    /* 3 */
    {0x00000025, 0x07E00000},    /* 4 */
    {0x00000025, 0x07E80000},    /* 5 */
    {0x00000025, 0x07F00000},    /* 6 */
    {0x00000025, 0x07F80000},    /* 7 */
    {0x00000025, 0x00000000},    /* 8 */
    {0x00000025, 0x00080000},    /* 9 */
    {0x00000025, 0x00100000},    /* 10 */
    {0x00000025, 0x00180000},    /* 11 */
    {0x00000025, 0x00200000},    /* 12 */
    {0x00000025, 0x00280000},    /* 13 */
    {0x00000025, 0x00300000},    /* 14 */
    {0x00000025, 0x00380000},    /* 15 */
    {0x00000025, 0x00400000},    /* 16 */
    {0x00000025, 0x00480000},    /* 17 */
    {0x00000025, 0x00500000},    /* 18 */
    {0x00000025, 0x00580000},    /* 19 */
    {0x00000025, 0x00600000},    /* 20 */
    {0x00000025, 0x00680000},    /* 21 */
    {0x00000025, 0x00700000},    /* 22 */
    {0x00000025, 0x00780000},    /* 23 */
    {0x00000025, 0x00800000},    /* 24 */
    {0x00000025, 0x00880000},    /* 25 */
    {0x00000025, 0x00900000},    /* 26 */
    {0x00000025, 0x00980000},    /* 27 */
    {0x00000025, 0x00A00000},    /* 28 */
    {0x00000025, 0x00A80000},    /* 29 */
    {0x00000025, 0x00B00000},    /* 30 */
    {0x00000025, 0x00B80000},    /* 31 */
    {0x00000025, 0x00C00000},    /* 32 */
    {0x00000025, 0x00C80000},    /* 33 */
    {0x00000025, 0x00D00000},    /* 34 */
    {0x00000025, 0x00D80000},    /* 35 */
    {0x00000025, 0x00E00000},    /* 36 */
    {0x00000025, 0x00E80000},    /* 37 */
    {0x00000025, 0x00F00000},    /* 38 */
    {0x00000025, 0x00F80000},    /* 39 */
    {0x00000025, 0x01000000},    /* 40 */
    {0x00000026, 0x07080000},    /* 41 */
    {0x00000026, 0x07100000},    /* 42 */
    {0x00000026, 0x07180000},    /* 43 */
    {0x00000026, 0x07200000},    /* 44 */
    {0x00000026, 0x07280000},    /* 45 */
    {0x00000026, 0x07300000},    /* 46 */
    {0x00000026, 0x07380000},    /* 47 */
    {0x00000026, 0x07400000},    /* 48 */
    {0x00000026, 0x07480000},    /* 49 */
    {0x00000026, 0x07500000},    /* 50 */
    {0x00000026, 0x07580000},    /* 51 */
    {0x00000026, 0x07600000},    /* 52 */
    {0x00000026, 0x07680000},    /* 53 */
    {0x00000026, 0x07700000},    /* 54 */
    {0x00000026, 0x07780000},    /* 55 */
    {0x00000026, 0x07800000},    /* 56 */
    {0x00000026, 0x07880000},    /* 57 */
    {0x00000026, 0x07900000},    /* 58 */
    {0x00000026, 0x07980000},    /* 59 */
    {0x00000026, 0x07A00000},    /* 60 */
    {0x00000026, 0x07A80000},    /* 61 */
    {0x00000026, 0x07B00000},    /* 62 */
    {0x00000026, 0x07B80000},    /* 63 */
    {0x00000026, 0x07C00000},    /* 64 */
    {0x00000026, 0x07C80000},    /* 65 */
    {0x00000026, 0x07D00000},    /* 66 */
    {0x00000026, 0x07D80000},    /* 67 */
    {0x00000026, 0x07E00000},    /* 68 */
    {0x00000026, 0x07E80000},    /* 69 */
    {0x00000026, 0x07F00000},    /* 70 */
    {0x00000026, 0x07F80000},    /* 71 */
    {0x00000026, 0x00000000},    /* 72 */
    {0x00000026, 0x00080000},    /* 73 */
    {0x00000026, 0x00100000},    /* 74 */
    {0x00000026, 0x00180000},    /* 75 */
    {0x00000026, 0x00200000},    /* 76 */
    {0x00000026, 0x00280000},    /* 77 */
    {0x00000026, 0x00300000},    /* 78 */
    {0x00000026, 0x00380000},    /* 79 */
    {0x00000026, 0x00400000},    /* 80 */
    {0x00000026, 0x00480000},    /* 81 */
    {0x00000026, 0x00500000},    /* 82 */
    {0x00000026, 0x00580000},    /* 83 */
    {0x00000026, 0x00600000},    /* 84 */
    {0x00000026, 0x00680000},    /* 85 */
    {0x00000026, 0x00700000},    /* 86 */
    {0x00000026, 0x00780000},    /* 87 */
    {0x00000026, 0x00800000},    /* 88 */
    {0x00000026, 0x00880000},    /* 89 */
    {0x00000026, 0x00900000},    /* 90 */
    {0x00000026, 0x00980000},    /* 91 */
    {0x00000026, 0x00A00000},    /* 92 */
    {0x00000026, 0x00A80000},    /* 93 */
    {0x00000026, 0x00B00000},    /* 94 */
    {0x00000026, 0x00B80000},    /* 95 */
    {0x00000026, 0x00C00000},    /* 96 */
    {0x00000026, 0x00C80000},    /* 97 */
    {0x00000026, 0x00D00000},    /* 98 */
    {0x00000026, 0x00D80000},    /* 99 */
    {0x00000026, 0x00E00000},    /* 100 */
    {0x00000026, 0x00E80000},    /* 101 */
    {0x00000026, 0x00F00000},    /* 102 */
    {0x00000026, 0x00F80000},    /* 103 */
    {0x00000026, 0x01000000},    /* 104 */
    {0x00000027, 0x07080000},    /* 105 */
    {0x00000027, 0x07100000},    /* 106 */
    {0x00000027, 0x07180000},    /* 107 */
    {0x00000027, 0x07200000},    /* 108 */
    {0x00000027, 0x07280000},    /* 109 */
    {0x00000027, 0x07300000},    /* 110 */
    {0x00000027, 0x07380000},    /* 111 */
    {0x00000027, 0x07400000},    /* 112 */
    {0x00000027, 0x07480000},    /* 113 */
    {0x00000027, 0x07500000},    /* 114 */
    {0x00000027, 0x07580000},    /* 115 */
    {0x00000027, 0x07600000},    /* 116 */
    {0x00000027, 0x07680000},    /* 117 */
    {0x00000027, 0x07700000},    /* 118 */
    {0x00000027, 0x07780000},    /* 119 */
    {0x00000027, 0x07800000},    /* 120 */
    {0x00000027, 0x07880000},    /* 121 */
    {0x00000027, 0x07900000},    /* 122 */
    {0x00000027, 0x07980000},    /* 123 */
    {0x00000027, 0x07A00000},    /* 124 */
    {0x00000027, 0x07A80000},    /* 125 */
    {0x00000027, 0x07B00000},    /* 126 */
    {0x00000027, 0x07B80000}     /* 127 */
};

/* Registers for timing of TX & RX */
#if RF_OSC_26MHZ == 1
uint16_t tx_rx_on_delay = TX_RX_ON_DELAY_VAL_26MHZ;
#else
uint16_t tx_rx_on_delay = TX_RX_ON_DELAY_VAL;
#endif
uint16_t tx_rx_synth_delay = TX_RX_SYNTH_DELAY_VAL;

