Ove88/kw41z-rf-driver/source/fsl_xcvr.c
    if (status == gXcvrSuccess_c)
    {
        switch (data_rate)
        {
            case DR_1MBPS:
                dft_clk_sel = 4;
                break;
            case DR_500KBPS:
                dft_clk_sel = 3;
                break;
            case DR_250KBPS:
                dft_clk_sel = 2;
                break;
            default:
                status = gXcvrInvalidParameters_c;
                break;
        }
    }

    if (bitrate_setting < 4)
    {
        GENFSK->BITRATE = bitrate_setting;
    }

        temp = XCVR_TX_DIG->CTRL;
        temp &= ~(XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK |
            XCVR_TX_DIG_CTRL_LFSR_LENGTH_MASK |
            XCVR_TX_DIG_CTRL_DFT_CLK_SEL_MASK |
            XCVR_TX_DIG_CTRL_TX_DFT_EN_MASK |
            XCVR_TX_DIG_CTRL_LFSR_EN_MASK);
        temp |=  XCVR_TX_DIG_CTRL_RADIO_DFT_MODE(dft_mode) |
                XCVR_TX_DIG_CTRL_LFSR_LENGTH(lfsr_length) |
                XCVR_TX_DIG_CTRL_DFT_CLK_SEL(dft_clk_sel) |
                XCVR_TX_DIG_CTRL_TX_DFT_EN(0) |
                XCVR_TX_DIG_CTRL_LFSR_EN(1);
        XCVR_TX_DIG->CTRL = temp;

    if (status == gXcvrSuccess_c)
    {
        /* Warm-up the Radio */
        XCVR_ForceTxWu();
    }

    return status;
}

void XCVR_DftTxOff(void)
{
    XCVR_ForceTxWd();
    XCVR_MISC->XCVR_CTRL |= XCVR_CTRL_XCVR_CTRL_TGT_PWR_SRC_MASK; /* Use PA_POWER in LL registers */
    /* Clear the RF Channel over-ride */
    XCVR_OverrideChannel(0xFF,1);
    XCVR_TX_DIG->CTRL &= ~(XCVR_TX_DIG_CTRL_RADIO_DFT_MODE_MASK | /* Clear DFT_MODE */
                        XCVR_TX_DIG_CTRL_DFT_CLK_SEL_MASK | /* Clear DFT_CLK_SEL */
                        XCVR_TX_DIG_CTRL_TX_DFT_EN_MASK | /* Clear DFT_EN */
                        XCVR_TX_DIG_CTRL_LFSR_EN_MASK);/* Clear LFSR_EN */
}

xcvrStatus_t XCVR_ForcePAPower(uint8_t pa_power)
{
    if (pa_power > 0x3F)
    {
        return gXcvrInvalidParameters_c; /* Failure */
    }
    
    if (pa_power != 1)
    {
        pa_power = pa_power & 0xFEU; /* Ensure LSbit is cleared */
    }
    
    XCVR_MISC->XCVR_CTRL &= ~XCVR_CTRL_XCVR_CTRL_TGT_PWR_SRC_MASK; /* Use PA_POWER in TSM registers */
    XCVR_TSM->PA_POWER = pa_power;

    return gXcvrSuccess_c; /* Success */
}